import regex
from collections import Counter
from mlmorph import Analyser

sw = "കാണാന് | നിന്ന് | കുറഞ്ഞ | മുഴുവന് | കൂടാതെ | ആദ്യം | ഈ | കൂടുതല് | താങ്കള് | എന്നാല് | അതിനു | ശേഷം " \
     "| ചെയ്യുന്നു | ഇവിടത്തെ | വേണ്ടി | ഏറ്റവും | ഇതില് | വേണ്ടിയും | ആണ് | സ്ഥിതിചെയ്യുന്നു | സ്ഥിതി" \
     " | സ്ഥിതിചെയ്യുന്ന | ചെയ്യണം | നമ്മുടെ | ഇപ്പോള് | ഒരു | തന്റെ | ചെയ്യുന്ന | എന്ന | ചെയ്യുന്നത് |" \
     " ഉണ്ട് | മുന്പ് | മുമ്പ് | കൂടെ | ചേര്ത്തു | ഇപ്രകാരം | എന്നിവയുടെ | " \
     "കഴിയും | എന്നീ | ഇതാണ് | വളരെ | കാരണം | ഇവിടത്തെ | എപ്പോഴും | കൊണ്ട് | നല്ല | ധാരാളം |" \
     " എപ്പോഴും | ഇവ | കാരണം | ഇതു | മാത്രമല്ല | മറ്റു | എന്നിവ | കൂടിയാണ് | ഇടയില് | ഇല്ല | എന്നാണ് | എന്നു | കുറച്ച് " \
     "| അതായത് | എന്തെന്നാല് | എന്നറിയപ്പെടുന്നു | കിടക്കുന്ന | പോയാല് | ഇത് | എല്ലാ | വേണ്ടി | ഇവിടെ | വരുന്നു " \
     "| പോലുള്ള  | വലിയ | പറഞ്ഞ് | ഇതിനെ | കൊടുത്തിട്ടും | എന്ന് | വേണം | ഒരുപോലെ |" \
     " ഒരു പോലെ | കാര്യമാണ് | കഴിയുന്നു | വളരെ | അധികം | വളരെ അധികം | വളരെയധികം | പോയി |" \
     " ഉണ്ടാകുന്നുണ്ട് | പക്ഷേ | അതേ | കൊണ്ട് | ഏത് | നിന്നും | എത്താന് | അടുത്ത് | ആയി " \
     "| എന്നു പറയുന്നു | ഇപ്പോൾ | ഏകദേശം | എന്നുപറയുന്നു | കാണാൻ | ആ | വിവിധ | ഇതിന്റെ | നിന്നു | ഇതിന് " \
     "| അടുത്ത | അടുത്തുള്ള | പല | പ്രധാന | നിലനിൽക്കുന്ന | നിലനിൽക്കുന്നത് | മുതലായവ | മുതലായവക്ക് " \
     "| വേണ്ട | പ്രാധാന്യം"


def lev_sim(x, y):
    m = max(x, y)
    return round(abs(x - y) / m, 2)


analyser = Analyser()


def split_sentence(text):
    text = text.strip()
    words = regex.split(r'(\s+)', text)
    temp = []
    delim = ",.!?/&-:;@'..."
    for word in words:
        strip_num = regex.sub('[0-9]+\S+', '', word)
        strip_whitespace = regex.sub('\s+', '', strip_num)
        temp.append(strip_whitespace)
    words = temp
    words = [x for x in words if x not in delim]  # strip delim
    fin = []
    for i in words:
        # remove stop words
        morpheme = None
        if i not in sw:
            morpheme = analyser.analyse(i)  # split word into morpheme
        if morpheme:
            # take only the first morpheme and also remove metadata
            y = regex.match(r'(.*?)<', morpheme[0][0]).group(1)
            fin.append(y)

    return fin


def split_text(text):
    # remove unnecessary unicode chars
    text = text.replace('\u200d', '')
    text = text.replace('\u200c', '')
    text = text.split('.')[:-1]
    words = Counter()
    counter = 1
    sentences = {}
    length = 0
    for i in text:
        s = split_sentence(i)
        length += len(s)
        sentences.update({counter: [s, i]})
        words.update(s)
        counter = counter + 1
    ret = [sentences, words, length]
    return ret


def affinity(dictionary, counter, length):
    aff = {}
    for i in dictionary:
        x = 0
        words = dictionary[i][0]
        for j in words:
            x += counter[j] / length
        aff.update({i: round(x, 3) / 10})
    return aff


#article = "മനുഷ്യൻ ആദ്യമായി ചന്ദ്രനിൽ കാലുകുത്തിയിട്ട് ഈ ജൂലൈ 20ന് 40 വർഷം തികയുന്നു. 1969 ജൂലൈ 20ന് അമേരിക്കന് ബഹിരാകാശ സഞ്ചാരി നീൽ ആറ്മസ്ട്രോങ് ആദ്യമായി ചന്ദ്രനിൽ കാലുകുത്തുന്നു മനുഷ്യനെന്ന ബഹുമതി നേടി. ഭൂമിയിൽനിന്നു രണ്ടരലക്ഷം നാഴിക അകലെയുള്ള ചന്ദ്രനിൽ ആളെയിറക്കി സുരക്ഷിതമായി ഭൂമിയിൽ തിരിച്ചെത്തിക്കുക എന്ന ദൗത്യവുമായി അമേരിക്ക അപ്പോളോ പദ്ധതിക്ക് രൂപം നൽകുന്നത്. അപ്പോളോ - അമേരിക്ക  ആദ്യമായി ചന്ദ്രനിൽ മനുഷ്യനെ ഇറക്കിയ ഉപഗ്രഹം."
#article = "200 കൊല്ലമായി ഒരുവിധത്തിലുമുള്ള സൈനികസഖ്യത്തിന്റെ ഭാഗമല്ല സ്വീഡന്. ഫിന്ലന്ഡ് ആകട്ടെ രണ്ടാം ലോകമഹായുദ്ധത്തിനു ശേഷം ആരുമായും സൈനികസഖ്യത്തില് ഏര്പ്പെട്ടിട്ടുമില്ല. നിലവില് നാറ്റോയുമായി മെച്ചപ്പെട്ട ബന്ധം തന്നെയാണ് സ്വീഡനും ഫിന്ലന്ഡിനുമുള്ളത്. ഔദ്യോഗികമായി അംഗത്വം നേടുക എന്ന പ്രക്രിയയാണ് ഇനി ബാക്കിയുള്ളത്. ഇതിനുള്ള ഔദ്യോഗിക അപേക്ഷ ഇരുരാജ്യങ്ങളും കഴിഞ്ഞ ദിവസങ്ങളില് സമര്പ്പിക്കുകയും ചെയ്തു. പതിറ്റാണ്ടുകളായി പാലിച്ചുവന്നിരുന്ന നിഷ്പക്ഷ നിലപാട് അവസാനിപ്പിച്ച് നാറ്റോ അഥവാ നോര്ത്ത് അറ്റ്‌ലാന്റിക് ട്രീറ്റി ഓര്ഗനൈസേഷന്റെ ഭാഗമാകാന് ഒരുങ്ങുകയാണ് സ്‌കാന്ഡിനേവിയന് രാജ്യങ്ങളായ ഫിന്ലന്ഡും സ്വീഡനും. ഇരുരാജ്യങ്ങളും ഇതിനുള്ള അപേക്ഷ നാറ്റോ സെക്രട്ടറി ജനറലിന് ഔദ്യോഗികമായി സമര്പ്പിക്കുകയും ചെയ്തു. റഷ്യ-യുക്രൈന് യുദ്ധമാണ് ഇത്തരത്തിലൊരു നിലപാടു മാറ്റത്തിന് ഇരുരാജ്യങ്ങളെയും പ്രേരിപ്പിച്ചത്. റഷ്യയെ പ്രകോപിപ്പിക്കാതിരിക്കുകയും അതേസമയം തന്നെ നാറ്റോയുമായി നല്ലബന്ധം സ്ഥാപിക്കുകയും ചെയ്യുന്ന രീതിയായിരുന്നു ഫിന്ലന്ഡും സ്വീഡനും ഇക്കാലമത്രയും അനുവര്ത്തിച്ചു പോന്നിരുന്നത്. അതില്നിന്ന് മാറി നാറ്റോയില് അംഗത്വം എടുക്കാനുള്ള ഇരുരാജ്യങ്ങളുടെയും ഈ നീക്കം മേഖലയിലെ രാഷ്ട്രീയഭൂപടത്തെ മാറ്റിവരയ്ക്കുമെന്ന കാര്യത്തില് സംശയമില്ല. ഫെബ്രുവരി 24-നാണ് യുക്രൈനെതിരേ റഷ്യ യുദ്ധം പ്രഖ്യാപിച്ചത്. ഇത് മൂന്നാംമാസവും തുടരുകയാണ്. യുക്രൈന് നാറ്റോയില് ചേരുന്നതില് പ്രകോപിതരായാണ് റഷ്യ യുദ്ധം പ്രഖ്യാപിച്ചത്. താരതമ്യേന ദുര്ബലരായ യുക്രൈന് യുദ്ധത്തിന്റെ ആദ്യദിനങ്ങളില് തന്നെ വീഴുമെന്നായിരുന്നു പലരും കരുതിയിരുന്നത്. എന്നാല് നാറ്റോയുടെ സൈനികപിന്തുണ യുക്രൈനെ പിടിച്ചുനിര്ത്തി. കെടുതികളും മുറിവുകളും മാത്രം അവശേഷിപ്പിക്കുന്ന യുദ്ധം മൂന്നാംമാസത്തിലേക്ക് കടക്കുമ്പോള്, യൂറോപ്പിന്റെ രാഷ്ട്രീയ ഭൂപടത്തിലും ശാക്തികബലാബലത്തിലുണ്ടാക്കുന്ന മാറ്റത്തിന്റെ കൂടി സൂചനയാണ് സ്വീഡന്റെയും ഫിന്ലന്ഡിന്റെയും ഈ ചുവടുമാറ്റം. 200 കൊല്ലമായി ഒരുവിധത്തിലുമുള്ള സൈനികസഖ്യത്തിന്റെ ഭാഗമല്ല സ്വീഡന്. ഫിന്ലന്ഡ് ആകട്ടെ രണ്ടാം ലോകമഹായുദ്ധത്തിനു ശേഷം ആരുമായും സൈനികസഖ്യത്തില് ഏര്പ്പെട്ടിട്ടുമില്ല. നിലവില് നാറ്റോയുമായി മെച്ചപ്പെട്ട ബന്ധം തന്നെയാണ് സ്വീഡനും ഫിന്ലന്ഡിനുമുള്ളത്. ഔദ്യോഗികമായി അംഗത്വം നേടുക എന്ന പ്രക്രിയയാണ് ഇനി ബാക്കിയുള്ളത്. ഇതിനുള്ള ഔദ്യോഗിക അപേക്ഷ ഇരുരാജ്യങ്ങളും കഴിഞ്ഞ ദിവസങ്ങളില് സമര്പ്പിക്കുകയും ചെയ്തു.'ഒരു കാലഘട്ടം ഉപേക്ഷിച്ച് മറ്റൊന്നിലേക്ക് കടക്കുകയാണ് സ്വീഡന്. സഖ്യത്തിലെ അംഗരാജ്യമാകാന് താല്പര്യപ്പെടുന്ന കാര്യം ഞങ്ങള് നാറ്റോയെ അറിയിക്കും. ' നാറ്റോയില് ചേരാനുള്ള ഔദ്യോഗിക നടപടികള് ആരംഭിച്ചതിന്റെ പശ്ചാത്തലത്തിലുള്ളതാണ് സ്വീഡിഷ് പ്രധാനമന്ത്രി മഗ്‌ദെലന ആന്ഡേഴ്‌സണിന്റെ ഈ വാക്കുകള്. ഈ നീക്കത്തിന് സ്വീഡിഷ് പാര്ലമെന്റിലെ ഭൂരിപക്ഷത്തിന്റെ പിന്തുണയുണ്ടെന്നും അവര് വ്യക്തമാക്കുന്നു. മഗ്‌ദെലന അംഗമായ സോഷ്യല് ഡെമോക്രാറ്റിക് പാര്ട്ടി, നാറ്റോയില് അംഗത്വം തേടാനുള്ള നീക്കത്തെ പിന്തുണച്ചതിന് പിന്നാലെയായിരുന്നു പ്രധാനമന്ത്രിയുടെ പ്രതികരണം. മുന്പ് പാശ്ചാത്യ സൈനിക സഖ്യത്തില് അംഗത്വം നേടുന്നതിനോട് സോഷ്യല് ഡെമോക്രാറ്റിക് പാര്ട്ടിക്ക് എതിര്പ്പായിരുന്നു. പ്രധാനമന്ത്രി സന്നാ മാരിനും പ്രസിഡന്റ് സോലി നിനിസ്റ്റോയും ചേര്ന്ന് വാര്ത്താസമ്മേളനത്തിലാണ് ഫിന്ലന്ഡ് നാറ്റോയില് ചേരുമെന്ന പ്രഖ്യാപനം നടത്തിയത്. ചരിത്രപ്രധാനമായ ദിനമാണെന്നും ഒരു പുതിയ കാലഘട്ടം ആരംഭിക്കുകയാണെന്നുമായിരുന്നു പ്രസിഡന്റ് നിനിസ്റ്റോയുടെ വാക്കുകള്. നാറ്റോ അംഗത്വം ഫിന്ലന്ഡിന്റെ സുരക്ഷ ശക്തിപ്പെടുത്തും. നാറ്റോ അംഗമാകുന്നതോടെ ആ സൈനികസഖ്യത്തെയാകെ ശക്തിപ്പെടുത്താന് ഫിന്ലന്ഡിന് കഴിയുമെന്നും മാരിനും നിനിസ്റ്റോയും സംയുക്ത പ്രസ്താവനയില് അറിയിച്ചു. റഷ്യയുമായി 1,300 കിലോമീറ്റര് അതിര്ത്തി പങ്കിടുന്ന രാജ്യമാണ് ഫിന്ലന്ഡ്. നാറ്റോയില് ഫിന്ലന്ഡ് അംഗത്വം എടുക്കുന്ന പക്ഷം നാറ്റോയും റഷ്യയും തമ്മിലുള്ള അതിര്ത്തി കൂടിയായി ഇത് മാറും. രണ്ടാം ലോകമഹായുദ്ധകാലത്ത് ഫിന്ലന്ഡും റഷ്യയും വിരുദ്ധചേരിയിലായിരുന്നു. ഇരുവരും തമ്മില് വിന്റര് വാര്, കണ്ടിന്യൂഷന് വാര് എന്നിങ്ങനെ രണ്ടുവട്ടം യുദ്ധവും നടന്നിട്ടുണ്ട്. 1939 ലായിരുന്നു വിന്റര് വാര്. കൃത്യമായി പറഞ്ഞാല് രണ്ടാംലോകമഹായുദ്ധം ആരംഭിച്ച് രണ്ടുമാസത്തിനിപ്പുറം 1939 നവംബര് 30-ന് സോവിയറ്റ് യൂണിയന് ഫിന്ലന്ഡിലേക്ക് അധിനിവേശം നടത്തി. ഫിന്ലന്ഡ് പ്രതിരോധിച്ചു. എന്നാല് മൂന്നുമാസം നീണ്ടുനിന്ന യുദ്ധം, മോസ്‌കോ സമാധാന കരാറിലൂടെ 1940 മാര്ച്ച് 13-ന് അവസാനിച്ചപ്പോള് ഫിന്ലന്ഡിന് പത്തുശതമാനത്തോളം പ്രദേശം നഷ്ടമാവുകയും ചെയ്തു. പിന്നീട് റഷ്യയുമായി ഒരു ഏറ്റുമുട്ടല് ഒഴിവാക്കുന്നതിന്റെ ഭാഗമായി ശീതയുദ്ധകാലത്ത് നിഷ്പക്ഷ നിലപാടായിരുന്നു ഫിന്ലന്ഡ് സ്വീകരിച്ചിരുന്നത്. നാറ്റോയില് ചേരണോ വേണ്ടയോ എന്ന വിഷയത്തില് ഇക്കഴിഞ്ഞ ദിവസം നടന്ന അഭിപ്രായസര്വേയില് 76 ശതമാനം ഫിന്നിഷ് പൗരന്മാരും അനുകൂല നിലപാടാണ് സ്വീകരിച്ചതെന്ന് അന്താരാഷ്ട്ര മാധ്യമങ്ങള് റിപ്പോര്ട്ട് ചെയ്യുന്നു. 12 ശതമാനം പേര് മാത്രമാണ് എതിര്പ്പുന്നയിച്ചത്. മുന്പ് നടന്ന അഭിപ്രായസര്വേകളെ അപേക്ഷിച്ച് നാറ്റോ സഖ്യനീക്കത്തെ അനുകൂലിക്കുന്നവരുടെ എണ്ണത്തില് വന്വര്ധനയാണ് ഉണ്ടായിട്ടുള്ളത്. റഷ്യയിലെ രണ്ടാമത്തെ വലിയ നഗരമായ സെയ്ന്റ് പീറ്റേഴ്സ്ബെര്ഗ്, ഫിന്ലന്ഡ് അതിര്ത്തിയില്നിന്ന് വെറും 170 കിലോമീറ്റര് അകലെയാണ് സ്ഥിതി ചെയ്യുന്നത്."
article = """
സൈന്യത്തിൽ നാല് വർഷത്തെ ഹ്രസ്വനിയമനത്തിനു കേന്ദ്രസർക്കാർ പ്രഖ്യാപിച്ച അഗ്നിപഥ് പദ്ധതി നിർത്തിവയ്ക്കണമെന്നാവശ്യപ്പെട്ട് മുഖ്യമന്ത്രി പിണറായി വിജയൻ പ്രധാനമന്ത്രി നരേന്ദ്ര മോദിക്ക് കത്തയച്ചു. താൽക്കാലിക നിയമന പദ്ധതിക്കെതിരെ യുവജനങ്ങളുടെ രാജ്യവ്യാപക പ്രതിഷേധങ്ങൾ ഉയർന്നിരിക്കുകയാണ്. ദേശീയ സുരക്ഷാ വിദഗ്ധരും സേനയിൽനിന്ന് വിരമിച്ച പ്രമുഖരും പദ്ധതിയുടെ പ്രശ്നങ്ങൾ ചൂണ്ടിക്കാണിക്കുകയുണ്ടായി. ഈ വിമർശനങ്ങളെ കണക്കിലെടുക്കണമെന്ന് മുഖ്യമന്ത്രി കത്തിൽ അഭ്യർത്ഥിച്ചു.
രാജ്യത്തെ യുവാക്കളുടെ തൊഴിൽ സ്വപ്നമാണ് സൈനിക ഉദ്യോഗം. രാജ്യസുരക്ഷ കാത്തുസൂക്ഷിക്കുകയെന്ന വലിയ കർത്തവ്യമാണ് അവർ നിർവഹിക്കുന്നത്. അതുകൊണ്ടുതന്നെ തൊഴിൽ സുരക്ഷിതത്വവും വേതനവും വിമുക്തഭട സംവരണവും മറ്റ് ആനുകൂല്യങ്ങളും അവർക്ക് നൽകുകയെന്നത് ഭരണകൂടത്തിന്റെ കടമയാണ്. വളരെ ചുരുങ്ങിയ തൊഴിൽ കാലാവധിയെന്നത് സൈനികോദ്യോഗത്തിന്റെ പ്രഫഷനലിസത്തെ ബാധിക്കുമെന്ന് വിദഗ്ധർ അഭിപ്രായപ്പെട്ടിട്ടുണ്ട്. ട്രെയിനിങ് കാലാവധിയിൽ നേടുന്ന വൈദഗ്ധ്യം വലിയ കാലയളവിലേക്കുള്ളതാണ്. നാലു വർഷമെന്ന ചുരുങ്ങിയ കാലാവധി രാജ്യസുരക്ഷയെ തന്നെ ബാധിച്ചേക്കും.
ഉന്നതവിദ്യാഭ്യാസത്തിനും മറ്റു തൊഴിൽ നൈപുണ്യം നേടുന്നതിനും ഉപയോഗിക്കേണ്ട കാലയളവുകൂടിയാണ് ഈ നാലുവർഷം. അഗ്നിപഥ് പദ്ധതിയിലെ നാലുവർഷ കാലത്തെ സേവനത്തിനു ശേഷം ഈ യുവാക്കളുടെ തൊഴിൽ ലഭ്യതക്കുള്ള സാധ്യതകളും ചുരുങ്ങും. ഈ വിഷയങ്ങൾക്കൊക്കെ കേന്ദ്രസർക്കാർ തൃപ്തികരമായ മറുപടി നൽകണമെന്ന് മുഖ്യമന്ത്രി കത്തിൽ പറഞ്ഞു. അതോടൊപ്പം നിലവിലെ സേനാ റിക്രൂട്മെന്റ് പ്രക്രിയയുടെ വിവിധ ഘട്ടങ്ങൾ പൂർത്തിയാക്കിയ പലരുടെയും ആശങ്കകൾ പരിഹരിക്കപ്പെടേണ്ടതുമുണ്ട്.
രാജ്യത്ത് നിലവിൽ സ്ഥിരം തൊഴിലവസരങ്ങൾ കുറയുകയും കേന്ദ്രസർക്കാർ സർവീസുകളിൽ നികത്തപ്പെടാത്ത ഒഴിവുകൾ കൂടിവരികയും ചെയ്യുകയാണ്. കണക്കുകൾ പ്രകാരം ഇന്ത്യയിലെ അനുവദിക്കപ്പെട്ട തസ്തികകളിൽ 22.76 ശതമാനം 2018- 19 ൽ ഒഴിഞ്ഞുകിടക്കുകയാണ്. 2020 മാർച്ച് ൊ വരെയുള്ള കണക്കുകൾ പ്രകാരം 8,72,243 തസ്തികകൾ കേന്ദ്ര സർക്കാർ വകുപ്പുകളിൽ നികത്താൻ ബാക്കിയുണ്ട്. രാജ്യത്തെ തൊഴിലന്വേഷകരുടെ വികാരം മാനിച്ചും വിദഗ്ധരുയർത്തിയ വിമർശനങ്ങളെ പരിഗണിച്ചും അഗ്നിപഥ് നിർത്തലാക്കണമെന്ന് മുഖ്യമന്ത്രി കത്തിൽ ആവശ്യപ്പെട്ടു.
അഗ്നിപഥ് പദ്ധതിക്കെതിരെ രാജ്യവ്യാപക പ്രതിഷേധം ശക്തമാകുന്നതിനിടെയാണ് മുഖ്യമന്ത്രിയുടെ കത്ത്. പദ്ധതിക്കെതിരെ കേരളത്തിലും ശനിയാഴ്ച പ്രതിഷേധം ഉണ്ടായി. തിരുവനന്തപുരത്ത് മുന്നൂറിലധികം ഉദ്യോഗാർഥികൾ രാജ്ഭവനിലേക്ക് മാർച്ച് നടത്തി. കോഴിക്കോടും പ്രതിഷേധ പ്രകടനം നടന്നു.
"""


def summarize(text):
    dictionary, counter, length = split_text(text)
    aff = affinity(dictionary, counter, length)
    aff = {k: v for k, v in sorted(aff.items(), key=lambda item: item[1])}
    final = {}
    count = 0
    for i in reversed(list(aff.keys())):
        if count == 4:
            break
        else:
            final.update({i: dictionary[i]})
        count += 1
    ret = []
    for i in sorted(list(final.keys())):
        ret.append([i, final[i][1].strip()])
        #print(i, final[i][1].strip())
    return ret


output = summarize(article)
print(output)
