import regex
import math
from collections import Counter
from mlmorph import Analyser

sw = "കാണാന് | നിന്ന് | കുറഞ്ഞ | മുഴുവന് | കൂടാതെ | ആദ്യം | ഈ | കൂടുതല് | താങ്കള് | എന്നാല് | അതിനു | ശേഷം " \
     "| ചെയ്യുന്നു | ഇവിടത്തെ | വേണ്ടി | ഏറ്റവും | ഇതില് | വേണ്ടിയും | ആണ് | സ്ഥിതിചെയ്യുന്നു | സ്ഥിതി" \
     " | സ്ഥിതിചെയ്യുന്ന | ചെയ്യണം | നമ്മുടെ | ഇപ്പോള് | ഒരു | തന്റെ | ചെയ്യുന്ന | എന്ന | ചെയ്യുന്നത് |" \
     " ഉണ്ട് | മുന്പ് | മുമ്പ് | കൂടെ | ചേര്ത്തു | ഇപ്രകാരം | എന്നിവയുടെ | " \
     "കഴിയും | എന്നീ | ഇതാണ് | വളരെ | കാരണം | ഇവിടത്തെ | എപ്പോഴും | കൊണ്ട് | നല്ല | ധാരാളം |" \
     " എപ്പോഴും | ഇവ | കാരണം | ഇതു | മാത്രമല്ല | മറ്റു | എന്നിവ | കൂടിയാണ് | ഇടയില് | ഇല്ല | എന്നാണ് | എന്നു | കുറച്ച് " \
     "| അതായത് | എന്തെന്നാല് | എന്നറിയപ്പെടുന്നു | കിടക്കുന്ന | പോയാല് | ഇത് | എല്ലാ | വേണ്ടി | ഇവിടെ | വരുന്നു " \
     "| പോലുള്ള  | വലിയ | പറഞ്ഞ് | ഇതിനെ | കൊടുത്തിട്ടും | എന്ന് | വേണം | ഒരുപോലെ |" \
     " ഒരു പോലെ | കാര്യമാണ് | കഴിയുന്നു | വളരെ | അധികം | വളരെ അധികം | വളരെയധികം | പോയി |" \
     " ഉണ്ടാകുന്നുണ്ട് | പക്ഷേ | അതേ | കൊണ്ട് | ഏത് | നിന്നും | എത്താന് | അടുത്ത് | ആയി " \
     "| എന്നു പറയുന്നു | ഇപ്പോൾ | ഏകദേശം | എന്നുപറയുന്നു | കാണാൻ | ആ | വിവിധ | ഇതിന്റെ | നിന്നു | ഇതിന് " \
     "| അടുത്ത | അടുത്തുള്ള | പല | പ്രധാന | നിലനിൽക്കുന്ന | നിലനിൽക്കുന്നത് | മുതലായവ | മുതലായവക്ക് " \
     "| വേണ്ട | പ്രാധാന്യം"


def lev_sim(x, y):
    m = max(x, y)
    return round(abs(x - y) / m, 2)


def get_cosine(vec1, vec2):
    intersection = set(vec1.keys()) & set(vec2.keys())
    numerator = sum([vec1[x] * vec2[x] for x in intersection])

    sum1 = sum([vec1[x] ** 2 for x in vec1.keys()])
    sum2 = sum([vec2[x] ** 2 for x in vec2.keys()])
    denominator = math.sqrt(sum1) * math.sqrt(sum2)

    if not denominator:
        return 0.0
    else:
        return float(numerator) / denominator


def text_to_vector(text):
    word = regex.compile(r'\w+')
    words = word.findall(text)
    return Counter(words)


def get_result(content_a, content_b):
    text1 = content_a
    text2 = content_b

    vector1 = text_to_vector(text1)
    vector2 = text_to_vector(text2)

    cosine_result = get_cosine(vector1, vector2)
    return cosine_result


analyser = Analyser()


def split_sentence(text):
    text = text.strip()
    words = regex.split(r'(\s+)', text)
    temp = []
    delim = ",.!?/&-:;@'..."
    for word in words:
        strip_num = regex.sub('[0-9]+\S+', '', word)
        strip_whitespace = regex.sub('\s+', '', strip_num)
        temp.append(strip_whitespace)
    words = temp
    words = [x for x in words if x not in delim]  # strip delim
    fin = []
    for i in words:
        # remove stop words
        morpheme = None
        if i not in sw:
            morpheme = analyser.analyse(i)  # split word into morpheme
        if morpheme:
            # take only the first morpheme and also remove metadata
            y = regex.match(r'(.*?)<', morpheme[0][0]).group(1)
            fin.append(y)

    return fin


def split_text(text):
    # remove unnecessary unicode chars
    text = text.replace('\u200d', '')
    text = text.replace('\u200c', '')
    text = text.split('.')[:-1]
    words = Counter()
    counter = 1
    sentences = {}
    length = 0
    for i in text:
        s = split_sentence(i)
        length += len(s)
        sentences.update({counter: [s, i]})
        words.update(s)
        counter = counter + 1
    ret = [sentences, words, length]
    return ret


def affinity(dictionary, counter, length):
    aff = {}
    for i in dictionary:
        x = 0
        words = dictionary[i][0]
        for j in words:
            x += counter[j] / length
        aff.update({i: round(x, 3) / 10})
    return aff


article = """
സുഷമ സ്വരാജിന് വിട; സംസ്കാരം വൈകീട്ട് മൂന്ന് മണിക്ക്.അന്തരിച്ച മുതിർന്ന ബി.ജെ.പി നേതാവും കേന്ദ്ര വിദേശകാര്യ മന്ത്രിയുമായിരുന്ന സുഷമ സ്വരാജിന്‍റെ സംസ്കാരം ഇന്ന്. വൈകീട്ട് മൂന്ന് മണിക്ക് ഡൽഹി ലോധി റോഡ് വൈദ്യുത ശ്മശാനത്തിലാണ് സംസ്കാര ചടങ്ങുകൾ നടക്കുക. രാവിലെ 11 മണി വരെ ഡൽഹി ജന്തർ മന്ദിറിലെ വസതിയിൽ പൊതുദർശനം. ശേഷം 12 മുതൽ മൂന്നു മണിവരെ ബി.ജെ.പി ആസ്ഥാനത്തേക്ക് പൊതുദർശനത്തിനായി ഭൗതിക ശരീരം കൊണ്ടു പോകും. തുടർന്ന് ലോധി റോഡ് വൈദ്യുത ശ്മശാനത്തിൽ പൂർണ ഔദ്യോഗിക ബഹുമതികളോടെ സംസ്കാര ചടങ്ങുകൾ നടക്കും. ചൊവ്വാഴ്ച രാത്രി ഹൃദയാഘാതമുണ്ടായതിനെ തുടർന്ന് ഡൽഹിയിലെ ഓൾ ഇന്ത്യ ഇൻസ്റ്റിറ്റ്യൂട്ട് ഓഫ് മെഡിക്കൽ സയൻസസിലായിരുന്നു (എയിംസ്) സുഷമ സ്വരാജിന്‍റെ അന്ത്യം. വൃക്ക മാറ്റിവെക്കൽ ശസ്ത്രക്രിയക്ക് വിധേയയായിരുന്ന സുഷമ കുറച്ചുകാലമായി രാഷ്ട്രീയത്തിൽ സജീവമായിരുന്നില്ല.  			സുഷമ സ്വരാജിന് വിട; സംസ്കാരം വൈകീട്ട് മൂന്ന് മണിക്ക്.മുതിർന്ന ബിജെപി നേതാവും മുൻ കേന്ദ്രമന്ത്രിയുമായ സുഷമ സ്വരാജ് (67) അന്തരിച്ചു. ഹൃദയാഘാതത്തെ തുടർന്ന് ഡൽഹി എയിംസ് ആശുപത്രിയിലായിരുന്നു അന്ത്യം. ഒന്നാം മോദി മന്ത്രിസഭയിൽ വിദേശകാര്യ മന്ത്രിയായിരുന്ന സുഷമ, ജനകീയ നിലപാടുകളിലൂടെ ശ്രദ്ധ പിടിച്ചുപറ്റിയ നേതാവാണ്. വാജ്പേയി മന്ത്രിസഭയിൽ വാർത്താവിതരണ–പ്രക്ഷേപണ മന്ത്രിയായിരുന്നു. രാവിലെ 11 വരെ വസതിയിൽ പൊതുദർശനം. 12 മുതൽ മൂന്നു വരെ ബിജെപി ആസ്ഥാനത്ത് പൊതുദർശനത്തിനു വയ്ക്കും. സംസ്കാരം മൂന്നു മണിക്ക് ലോധി റോഡ് വൈദ്യുത ശ്മശാനത്തിൽ നടക്കും.ഹരിയാന അംബാല കന്റോൺമെന്റിൽ 1952 ഫെബ്രുവരി 14ന് ജനിച്ച സുഷമ, എഴുപതുകളിൽ വിദ്യാർഥി രാഷ്ട്രീയത്തിലൂടെയാണ് പൊതുരംഗത്തെത്തിയത്. നിയമബിരുദം നേടിയ അവർ അടിയന്തരാവസ്ഥയ്ക്കെതിരായ പ്രക്ഷോഭപരിപാടികളിൽ പങ്കെടുത്തു. 1977ൽ ഹരിയാന നിയമസഭയിലെത്തിയ സുഷമ സംസ്ഥാനത്തെ ഏറ്റവും പ്രായം കുറഞ്ഞ മന്ത്രിയായി. 1980ൽ ജനതാ പാർട്ടിയിൽനിന്നു ജനസംഘ വിഭാഗം പിരിഞ്ഞു ബിജെപി രൂപീകരിച്ചതു മുതൽ സുഷമ പാർട്ടിയിലുണ്ട്.പിന്നീട് ദേശീയ നേതൃത്വത്തിലെത്തിയ അവർ 1990ൽ രാജ്യസഭാംഗമായി. 1998ൽ ഡൽഹിയുടെ ആദ്യ വനിതാ മുഖ്യമന്ത്രിയായി. ഹരിയാനയിലും ഉത്തരാഞ്ചലിലും മധ്യപ്രദേശിലും നിന്നു രാജ്യസഭയിലേക്കെത്തിയ സുഷമ, രണ്ടു തവണ ലോക്സഭയിലെത്തിയതു സൗത്ത് ഡൽഹി മണ്ഡലത്തിൽ നിന്നാണ്. 2009ലും 2014ലും മധ്യപ്രദേശിലെ വിദിശയിൽ നിന്നായിരുന്നു ലോക്സഭാ വിജയം. ഹരിയാനയിലെ കർണാൽ ലോക്സഭാ മണ്ഡലത്തിൽ 1980, 1989 തിരഞ്ഞെടുപ്പുകളിൽ പരാജയപ്പെട്ട ചരിത്രവും സുഷമയ്ക്കുണ്ട്.രാജ്യത്ത് ഒരു ദേശീയപാർട്ടിയുടെ വക്താവാകുന്ന ആദ്യ വനിതയെന്ന റെക്കോർഡും സുഷമയ്ക്ക് സ്വന്തം. ഡൽഹിയിലെ ആദ്യ വനിതാ മുഖ്യമന്ത്രി, ബിജെപിയിൽ നിന്നുള്ള ആദ്യ വനിതാ മുഖ്യമന്ത്രി, മുഴുവൻ സമയ വിദേശകാര്യമന്ത്രിയായ ആദ്യ ഇന്ത്യന്‍ വനിത, ലോക്സഭയിലെ ആദ്യ വനിതാ പ്രതിപക്ഷ നേതാവ് തുടങ്ങിയ ബഹുമതികളും സുഷമയ്ക്കു സ്വന്തം.സോഷ്യലിസ്റ്റ് നേതാവും മിസോറം മുൻ ഗവർണറും സുപ്രീംകോടതി മുതിർന്ന അഭിഭാഷകനുമായ സ്വരാജ് കൗശലാണു ഭർത്താവ്. രാജ്യസഭയിൽ ഒരേകാലത്ത് അംഗങ്ങളായിരുന്ന ദമ്പതികളെന്ന ബഹുമതിയും ഇവർക്കുണ്ട്. ബൻസൂരി ഏക പുത്രിയാണ്.				സുഷമ സ്വരാജിന് വിട; സംസ്കാരം വൈകീട്ട് മൂന്ന് മണിക്ക്. അന്തരിച്ച മുന്‍ വിദേശകാര്യ മന്ത്രിയും ബി.ജെ.പി. നേതാവുമായ സുഷമ സ്വരാജിന്റെ സംസ്കാര ചടങ്ങുകള്‍ ബുധനാഴ്ച വൈകിട്ട് നടക്കും. എയിംസില്‍നിന്ന് പുലര്‍ച്ചെയോടെ ഭൗതികശരീരം ഡല്‍ഹിയിലെ വസതിയിലെത്തിച്ചു. രാഷ്ട്രീയ-സാമൂഹിക-സാംസ്കാരിക രംഗത്തെ നിരവധി പേര്‍ ഡല്‍ഹിയിലെ വസതിയില്‍ ആദരാഞ്ജലി അര്‍പ്പിക്കാനെത്തി. ബുധനാഴ്ച ഉച്ചവരെ ഭൗതികശരീരം ഇവിടെ പൊതുദര്‍ശനത്തിനുവെയ്ക്കും. ശേഷം ഡല്‍ഹിയിലെ ബി.ജെ.പി. ആസ്ഥാനത്തും പൊതുദര്‍ശനത്തിന് സൗകര്യമുണ്ടാകും. ഉച്ചയ്ക്ക് 12 മുതല്‍ വൈകിട്ട് മൂന്നുമണി വരെയാണ് ബി.ജെ.പി. ആസ്ഥാനത്തെ പൊതുദര്‍ശനം. ഇതിനുശേഷം പൂര്‍ണ ഔദ്യോഗിക ബഹുമതികളോടെ ലോധി ശ്മശാനത്തില്‍ സംസ്കരിക്കും.ചൊവ്വാഴ്ച രാത്രി ഹൃദയാഘാതത്തെത്തുടര്‍ന്ന് സുഷമ സ്വരാജിനെ ഡല്‍ഹി എയിംസില്‍ പ്രവേശിപ്പിച്ചിരുന്നെങ്കിലും രാത്രി 11.15-ഓടെ അന്ത്യം സംഭവിക്കുകയായിരുന്നു. സുഷമ സ്വരാജിന്റെ വിയോഗമറിഞ്ഞ് കേന്ദ്രമന്ത്രിമാരും ബി.ജെ.പി. നേതാക്കളും എയിംസ് ആശുപത്രിയിലെത്തിയിരുന്നു. കേന്ദ്രമന്ത്രിമാരായ രാജ്നാഥ് സിങ്, നിര്‍മലാ സീതാരാമന്‍, എസ്. ജയശങ്കര്‍, രവിശങ്കര്‍ പ്രസാദ്, ഹര്‍ഷവര്‍ധന്‍, പ്രകാശ് ജാവേദ്ക്കര്‍, സ്മൃതി ഇറാനി തുടങ്ങിയവരും ആശുപത്രിയിലെത്തി ആദരാഞ്ജലി അര്‍പ്പിച്ചു.
"""


def summarize(text, limit):
    dictionary, counter, length = split_text(text)
    aff = affinity(dictionary, counter, length)
    aff = {k: v for k, v in sorted(aff.items(), key=lambda item: item[1])}
    final = {}
    count = 0
    for i in reversed(list(aff.keys())):
        if count == limit+5:
            break
        else:
            final.update({i: dictionary[i]})
        count += 1
    ret = []
    for i in sorted(list(final.keys())):
        ret.append([i, final[i][1].strip()])

    summary = [ret[0]]
    for i in range(1, len(ret)):
        for j in summary:
            if get_result(ret[i][1], j[1]) > 0.66:
                break
            elif ret[i] not in summary:
                summary.append(ret[i])
    # for i in range(len(summary)):
    #     print(summary[i][0], summary[i][1].strip())

    return summary[:limit]


output = summarize(article, 4)
print(output)
